def counter(x):
    i = 0
    y = 0
    n500 = 0
    n100 = 0
    n50 = 0
    n10 = 0
    n5 = 0
    n1 = 0

    y = 1000 - x

    print("จำนวนเงินทอน", y, "บาท")

    # แบงค์ 500
    n500 = y // 500
    i = y - (500 * n500)

    # แบงค์ 100
    n100 = i // 100
    i = i - (100 * n100)

    # แบงค์ 50
    n50 = i // 50
    i = i - (50 * n50)

    # เหรียญ 10
    n10 = i // 10
    i = i - (10 * n10)

    # เหรียญ 5 
    n5 = i // 5
    i = i - (5 * n5)

    # เหรียญ 1 
    n1 = i // 1
    i = i - (1 * n1)

    if n500 != 0:
        print("500", n500, "ใบ")

    if n100 != 0:
        print("100", n100, "ใบ")

    if n50 != 0:
        print("50", n50, "ใบ")

    if n10 != 0:
        print("10", n10, "เหรียญ")

    if n5 != 0:
        print("5", n5, "เหรียญ")

    if n1 != 0:
        print("1", n1, "เหรียญ")



x = int(input("Input: "))
counter(x)



